Merge pull request #257 from DocGerd/release/1.4.0
release: v1.4.0
